### 1. Import Dependecies

In [7]:
import numpy as np
import pandas as pd

### 2. Basic Data Processing

In [8]:
df = pd.read_csv('data/raw/Titanic-Dataset.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- Identifires = PassengerId
- Free text-columns = Name,Ticket,Cabin

In [9]:
df = df.drop(columns=['PassengerId','Name','Ticket','Cabin'])
df.head(10)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S
5         0       3    male   NaN      0      0   8.4583        Q
6         0       1    male  54.0      0      0  51.8625        S
7         0       3    male   2.0      3      1  21.0750        S
8         1       3  female  27.0      0      2  11.1333        S
9         1       2  female  14.0      1      0  30.0708        C

In [10]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

### 3. Handling NUll Values

#### 3.1 Imputation

##### 3.2.1 Age

In [13]:
mean = df['Age'].mean()
median = df['Age'].median()
mean = np.round(mean,2)
mean, median

(np.float64(29.7), 28.0)

In [15]:
df.loc[:,'Age'] = df['Age'].fillna(mean)

In [16]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

##### 3.2.2 Embarked

In [22]:
mode = df['Embarked'].mode()[0]
mode

'S'

In [24]:
df.loc[:,'Embarked'] = df['Embarked'].fillna(mode)

In [25]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

### 4.  Encode categorical variables

#### 4.1 One Hot Encoding for norminal variables

In [26]:
norminal_variables=['Sex','Embarked']
sex_dummies = pd.get_dummies(df['Sex'],prefix='Sex')
embarked_dummies = pd.get_dummies(df['Embarked'],prefix='Embarked')

df = pd.concat([df,sex_dummies],axis=1)
del df['Sex']

df=pd.concat([df,embarked_dummies],axis=1)
del df['Embarked']

df

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,False,True,False,False,True
1,1,1,38.0,1,0,71.2833,True,False,True,False,False
2,1,3,26.0,0,0,7.9250,True,False,False,False,True
3,1,1,35.0,1,0,53.1000,True,False,False,False,True
4,0,3,35.0,0,0,8.0500,False,True,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,False,True,False,False,True
887,1,1,19.0,0,0,30.0000,True,False,False,False,True
888,0,3,29.7,1,2,23.4500,True,False,False,False,True
889,1,1,26.0,0,0,30.0000,False,True,True,False,False
890,0,3,32.0,0,0,7.7500,False,True,False,True,False

#### 4.2 Label Encoding for Ordinal variables

- since Pclass is already in encode format no need to encode again